[
  {
    "title": "Front-End Development",
    "description": "I design and build responsive, visually appealing, and user-friendly interfaces that enhance engagement and accessibility. My focus is on delivering seamless experiences using modern frameworks and best practices.",
    "icon": "Devices"
  },
  {
    "title": "Back-End Development",
    "description": "I develop secure and scalable server-side architectures that ensure seamless data processing and system performance. From authentication to database management, I build efficient back-end solutions tailored to your needs.",
    "icon": "Storage"
  },
  {
    "title": "Database Management",
    "description": "I design and manage efficient databases to ensure secure, structured, and scalable data storage. Whether handling SQL or NoSQL databases, I optimize performance for seamless data retrieval and processing.",
    "icon": "DatasetLinked"
  },
  {
    "title": "API Development & Integration",
    "description": "I build and integrate APIs to connect applications and services seamlessly. Whether it's third-party API integration or developing custom RESTful or GraphQL APIs, I ensure smooth data communication and interoperability.",
    "icon": "Api"
  },
  {
    "title": "Performance Optimization",
    "description": "I optimize website and application performance by improving load times, reducing bottlenecks, and implementing best coding practices. My goal is to enhance speed, scalability, and overall efficiency.",
    "icon": "Speed"
  },
  {
    "title": "UI/UX Design",
    "description": "I craft visually compelling and intuitive user interfaces with a focus on accessibility and seamless interactions. My designs enhance engagement by prioritizing usability and modern design trends.",
    "icon": "Brush"
  },
  {
    "title": "SEO & Web Analytics",
    "description": "I optimize websites for search engines, improve visibility, and track user engagement through analytics. My approach enhances organic reach and ensures data-driven decision-making for better performance.",
    "icon": "TrendingUp"
  },
  {
    "title": "Security Implementation",
    "description": "I implement security best practices to protect applications from vulnerabilities, unauthorized access, and data breaches. My focus includes authentication, encryption, and compliance with industry security standards.",
    "icon": "Security"
  }
]
